app/Controllers/loginController.php

    public function login()
    {
        $persona = new persona_modelo();
        //de acuerdo al tipo de usuario te mostrara director y cliente
        $data = [
            'persona' => $persona->where('correo', $this->request->getPost('email'))->first()
        ];
---
SELECT *
FROM `personas`
WHERE `correo` = 'heidy36@gmail.com'
 LIMIT 1